# -*- coding: utf-8 -*-

ism_list = [('أبو الله', ''),
			('محمد أبو الله', 'محمد'),
			('ابو الله محمد', 'محمد'),
			('عبد الجبار', 'عبد الجبار'),
			('أبدول أبدول أبدول أبدول عبد جبار', 'أبدول أبدول أبدول أبدول عبد جبار'),
			('محمد بن لادن', 'محمد'),
			('أبدل آل كا', 'أبدل آل كا')]

nasab_list = [('بن لادن', 'بن لادن'),
			  ('بن بن لادن', 'بن بن لادن'),
			  ('بن بن بن لادن', 'بن بن بن لادن'),
			  ('بن بن بن بن بن بن بن بن لادن', 'بن بن بن بن بن بن بن بن لادن'),
			  ('بن عبد الجبار', 'بن عبد الجبار')]

kunya_list = [('محمد أبو جبار', 'أبو جبار'),
			  ('محمد أبو أبو أبو أبو جبار', 'أبو أبو أبو أبو جبار'),
			  ('محمد بن لادن أبو جبار', 'أبو جبار'),
			  ('محمد أبو جبار بن لادن', 'أبو جبار'),
			  ('أبو جبار', 'أبو جبار'),
			  ('أبو جبار أبو تشوبار', 'أبو جبار أبو تشوبار'),
			  ('أبو جبار أبو تشوبار أبو برابدو أبو لوي', 'أبو جبار أبو تشوبار أبو برابدو أبو لوي'),
			  ('نيكوديمو بن فاليريو أبو نون آل إيطاليا', 'أبو نون'),
			  ('نيكوديمو بن فاليريو', '')]

laqab_list  = [('نيكوديمو بن فاليريو',''),
			   ('محمد الفاييت بن لادن', 'الفاييت'),
			   ('محمد الفاييت ابو لادن', 'الفاييت'),
			   ('محمد الفاييت بن جيوفاني أبو لادن','الفاييت'),
			   ('محمد الفاييت بن جيوفاني أبو لادن الأفغاني محامدي', 'الفاييت')]

test_dict = {'ISM': ism_list, 'LAQAB': laqab_list, 'NASAB': nasab_list, 'KUNYA': kunya_list, 'NISBAH':[], 'LAQAB/NISBAH':[], 'OTHER':[]}